[
  {
    "id": "attack-pattern--348f1eef-964b-4eb6-bb53-69b3dcb0c643",
    "name": "Peripheral Device Discovery",
    "description": "Adversaries may attempt to gather information about attached peripheral devices and components connected to a computer system.(Citation: Peripheral Discovery Linux)(Citation: Peripheral Discovery macOS) Peripheral devices could include auxiliary resources that support a variety of functionalities such as keyboards, printers, cameras, smart card readers, or removable storage. The information may be used to enhance their awareness of the system and network environment or may be used for further actions.",
    "tactic": "discovery",
    "technique_name": "Peripheral Device Discovery",
    "technique_id": "T1120",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1120: Peripheral Device Discovery'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1120: Peripheral Device Discovery'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1120: Peripheral Device Discovery'"
      }
    ],
    "ability_id": "attack-pattern--348f1eef-964b-4eb6-bb53-69b3dcb0c643"
  },
  {
    "id": "attack-pattern--e358d692-23c0-4a31-9eb6-ecc13a8d7735",
    "name": "Remote System Discovery",
    "description": "Adversaries may attempt to get a listing of other systems by IP address, hostname, or other logical identifier on a network that may be used for Lateral Movement from the current system. Functionality could exist within remote access tools to enable this, but utilities available on the operating system could also be used such as  [Ping](https://attack.mitre.org/software/S0097), <code>net view</code> using [Net](https://attack.mitre.org/software/S0039), or, on ESXi servers, `esxcli network diag ping`.\n\nAdversaries may also analyze data from local host files (ex: <code>C:\\Windows\\System32\\Drivers\\etc\\hosts</code> or <code>/etc/hosts</code>) or other passive means (such as local [Arp](https://attack.mitre.org/software/S0099) cache entries) in order to discover the presence of remote systems in an environment.\n\nAdversaries may also target discovery of network infrastructure as well as leverage [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) commands on network devices to gather detailed information about systems within a network (e.g. <code>show cdp neighbors</code>, <code>show arp</code>).(Citation: US-CERT-TA18-106A)(Citation: CISA AR21-126A FIVEHANDS May 2021)  \n",
    "tactic": "discovery",
    "technique_name": "Remote System Discovery",
    "technique_id": "T1018",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1018: Remote System Discovery'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1018: Remote System Discovery'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1018: Remote System Discovery'"
      }
    ],
    "ability_id": "attack-pattern--e358d692-23c0-4a31-9eb6-ecc13a8d7735"
  },
  {
    "id": "attack-pattern--2959d63f-73fd-46a1-abd2-109d7dcede32",
    "name": "Windows Service",
    "description": "Adversaries may create or modify Windows services to repeatedly execute malicious payloads as part of persistence. When Windows boots up, it starts programs or applications called services that perform background system functions.(Citation: TechNet Services) Windows service configuration information, including the file path to the service's executable or recovery programs/commands, is stored in the Windows Registry.\n\nAdversaries may install a new service or modify an existing service to execute at startup in order to persist on a system. Service configurations can be set or modified using system utilities (such as sc.exe), by directly modifying the Registry, or by interacting directly with the Windows API. \n\nAdversaries may also use services to install and execute malicious drivers. For example, after dropping a driver file (ex: `.sys`) to disk, the payload can be loaded and registered via [Native API](https://attack.mitre.org/techniques/T1106) functions such as `CreateServiceW()` (or manually via functions such as `ZwLoadDriver()` and `ZwSetValueKey()`), by creating the required service Registry values (i.e. [Modify Registry](https://attack.mitre.org/techniques/T1112)), or by using command-line utilities such as `PnPUtil.exe`.(Citation: Symantec W.32 Stuxnet Dossier)(Citation: Crowdstrike DriveSlayer February 2022)(Citation: Unit42 AcidBox June 2020) Adversaries may leverage these drivers as [Rootkit](https://attack.mitre.org/techniques/T1014)s to hide the presence of malicious activity on a system. Adversaries may also load a signed yet vulnerable driver onto a compromised machine (known as \"Bring Your Own Vulnerable Driver\" (BYOVD)) as part of [Exploitation for Privilege Escalation](https://attack.mitre.org/techniques/T1068).(Citation: ESET InvisiMole June 2020)(Citation: Unit42 AcidBox June 2020)\n\nServices may be created with administrator privileges but are executed under SYSTEM privileges, so an adversary may also use a service to escalate privileges. Adversaries may also directly start services through [Service Execution](https://attack.mitre.org/techniques/T1569/002).\n\nTo make detection analysis more challenging, malicious services may also incorporate [Masquerade Task or Service](https://attack.mitre.org/techniques/T1036/004) (ex: using a service and/or payload name related to a legitimate OS or benign software component). Adversaries may also create ‘hidden’ services (i.e., [Hide Artifacts](https://attack.mitre.org/techniques/T1564)), for example by using the `sc sdset` command to set service permissions via the Service Descriptor Definition Language (SDDL). This may hide a Windows service from the view of standard service enumeration methods such as `Get-Service`, `sc query`, and `services.exe`.(Citation: SANS 1)(Citation: SANS 2)",
    "tactic": "persistence",
    "technique_name": "Windows Service",
    "technique_id": "T1543.003",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1543.003: Windows Service'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1543.003: Windows Service'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1543.003: Windows Service'"
      }
    ],
    "ability_id": "attack-pattern--2959d63f-73fd-46a1-abd2-109d7dcede32"
  },
  {
    "id": "attack-pattern--00f90846-cbd1-4fc5-9233-df5c2bf2a662",
    "name": "Archive via Utility",
    "description": "Adversaries may use utilities to compress and/or encrypt collected data prior to exfiltration. Many utilities include functionalities to compress, encrypt, or otherwise package data into a format that is easier/more secure to transport.\n\nAdversaries may abuse various utilities to compress or encrypt data before exfiltration. Some third party utilities may be preinstalled, such as <code>tar</code> on Linux and macOS or <code>zip</code> on Windows systems. \n\nOn Windows, <code>diantz</code> or <code> makecab</code> may be used to package collected files into a cabinet (.cab) file. <code>diantz</code> may also be used to download and compress files from remote locations (i.e. [Remote Data Staging](https://attack.mitre.org/techniques/T1074/002)).(Citation: diantz.exe_lolbas) <code>xcopy</code> on Windows can copy files and directories with a variety of options. Additionally, adversaries may use [certutil](https://attack.mitre.org/software/S0160) to Base64 encode collected data before exfiltration. \n\nAdversaries may use also third party utilities, such as 7-Zip, WinRAR, and WinZip, to perform similar activities.(Citation: 7zip Homepage)(Citation: WinRAR Homepage)(Citation: WinZip Homepage)",
    "tactic": "collection",
    "technique_name": "Archive via Utility",
    "technique_id": "T1560.001",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1560.001: Archive via Utility'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1560.001: Archive via Utility'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1560.001: Archive via Utility'"
      }
    ],
    "ability_id": "attack-pattern--00f90846-cbd1-4fc5-9233-df5c2bf2a662"
  },
  {
    "id": "attack-pattern--10d51417-ee35-4589-b1ff-b6df1c334e8d",
    "name": "External Remote Services",
    "description": "Adversaries may leverage external-facing remote services to initially access and/or persist within a network. Remote services such as VPNs, Citrix, and other access mechanisms allow users to connect to internal enterprise network resources from external locations. There are often remote service gateways that manage connections and credential authentication for these services. Services such as [Windows Remote Management](https://attack.mitre.org/techniques/T1021/006) and [VNC](https://attack.mitre.org/techniques/T1021/005) can also be used externally.(Citation: MacOS VNC software for Remote Desktop)\n\nAccess to [Valid Accounts](https://attack.mitre.org/techniques/T1078) to use the service is often a requirement, which could be obtained through credential pharming or by obtaining the credentials from users after compromising the enterprise network.(Citation: Volexity Virtual Private Keylogging) Access to remote services may be used as a redundant or persistent access mechanism during an operation.\n\nAccess may also be gained through an exposed service that doesn’t require authentication. In containerized environments, this may include an exposed Docker API, Kubernetes API server, kubelet, or web application such as the Kubernetes dashboard.(Citation: Trend Micro Exposed Docker Server)(Citation: Unit 42 Hildegard Malware)\n\nAdversaries may also establish persistence on network by configuring a Tor hidden service on a compromised system. Adversaries may utilize the tool `ShadowLink` to facilitate the installation and configuration of the Tor hidden service. Tor hidden service is then accessible via the Tor network because `ShadowLink` sets up a .onion address on the compromised system. `ShadowLink` may be used to forward any inbound connections to RDP, allowing the adversaries to have remote access.(Citation: The BadPilot campaign) Adversaries may get `ShadowLink` to persist on a system by masquerading it as an MS Defender application.(Citation: Russian threat actors dig in, prepare to seize on war fatigue)",
    "tactic": "persistence",
    "technique_name": "External Remote Services",
    "technique_id": "T1133",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1133: External Remote Services'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1133: External Remote Services'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1133: External Remote Services'"
      }
    ],
    "ability_id": "attack-pattern--10d51417-ee35-4589-b1ff-b6df1c334e8d"
  },
  {
    "id": "attack-pattern--7bc57495-ea59-4380-be31-a64af124ef18",
    "name": "File and Directory Discovery",
    "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from [File and Directory Discovery](https://attack.mitre.org/techniques/T1083) during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\n\nMany command shell utilities can be used to obtain this information. Examples include <code>dir</code>, <code>tree</code>, <code>ls</code>, <code>find</code>, and <code>locate</code>.(Citation: Windows Commands JPCERT) Custom tools may also be used to gather file and directory information and interact with the [Native API](https://attack.mitre.org/techniques/T1106). Adversaries may also leverage a [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) on network devices to gather file and directory information (e.g. <code>dir</code>, <code>show flash</code>, and/or <code>nvram</code>).(Citation: US-CERT-TA18-106A)\n\nSome files and directories may require elevated or specific user permissions to access.",
    "tactic": "discovery",
    "technique_name": "File and Directory Discovery",
    "technique_id": "T1083",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1083: File and Directory Discovery'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1083: File and Directory Discovery'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1083: File and Directory Discovery'"
      }
    ],
    "ability_id": "attack-pattern--7bc57495-ea59-4380-be31-a64af124ef18"
  },
  {
    "id": "attack-pattern--354a7f88-63fb-41b5-a801-ce3b377b36f1",
    "name": "System Information Discovery",
    "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use this information to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. This behavior is distinct from [Local Storage Discovery](https://attack.mitre.org/techniques/T1680) which is an adversary's discovery of local drive, disks and/or volumes.\n\nTools such as [Systeminfo](https://attack.mitre.org/software/S0096) can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the <code>systemsetup</code> configuration tool on macOS. Adversaries may leverage a [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) on network devices to gather detailed system information (e.g. <code>show version</code>).(Citation: US-CERT-TA18-106A) On ESXi servers, threat actors may gather system information from various esxcli utilities, such as `system hostname get` and `system version get`.(Citation: Crowdstrike Hypervisor Jackpotting Pt 2 2021)(Citation: Varonis)\n\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.(Citation: Amazon Describe Instance)(Citation: Google Instances Resource)(Citation: Microsoft Virutal Machine API)\n\n[System Information Discovery](https://attack.mitre.org/techniques/T1082) combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment.(Citation: OSX.FairyTale)(Citation: 20 macOS Common Tools and Techniques) ",
    "tactic": "discovery",
    "technique_name": "System Information Discovery",
    "technique_id": "T1082",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1082: System Information Discovery'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1082: System Information Discovery'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1082: System Information Discovery'"
      }
    ],
    "ability_id": "attack-pattern--354a7f88-63fb-41b5-a801-ce3b377b36f1"
  },
  {
    "id": "attack-pattern--f3c544dc-673c-4ef3-accb-53229f1ae077",
    "name": "System Time Discovery",
    "description": "An adversary may gather the system time and/or time zone settings from a local or remote system. The system time is set and stored by services, such as the Windows Time Service on Windows or <code>systemsetup</code> on macOS.(Citation: MSDN System Time)(Citation: Technet Windows Time Service)(Citation: systemsetup mac time) These time settings may also be synchronized between systems and services in an enterprise network, typically accomplished with a network time server within a domain.(Citation: Mac Time Sync)(Citation: linux system time)\n\nSystem time information may be gathered in a number of ways, such as with [Net](https://attack.mitre.org/software/S0039) on Windows by performing <code>net time \\\\hostname</code> to gather the system time on a remote system. The victim's time zone may also be inferred from the current system time or gathered by using <code>w32tm /tz</code>.(Citation: Technet Windows Time Service) In addition, adversaries can discover device uptime through functions such as <code>GetTickCount()</code> to determine how long it has been since the system booted up.(Citation: Virtualization/Sandbox Evasion)\n\nOn network devices, [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) commands such as `show clock detail` can be used to see the current time configuration.(Citation: show_clock_detail_cisco_cmd) On ESXi servers, `esxcli system clock get` can be used for the same purpose.\n\nIn addition, system calls – such as <code>time()</code> – have been used to collect the current time on Linux devices.(Citation: MAGNET GOBLIN) On macOS systems, adversaries may use commands such as <code>systemsetup -gettimezone</code> or <code>timeIntervalSinceNow</code> to gather current time zone information or current date and time.(Citation: System Information Discovery Technique)(Citation: ESET DazzleSpy Jan 2022)\n\nThis information could be useful for performing other techniques, such as executing a file with a [Scheduled Task/Job](https://attack.mitre.org/techniques/T1053)(Citation: RSA EU12 They're Inside), or to discover locality information based on time zone to assist in victim targeting (i.e. [System Location Discovery](https://attack.mitre.org/techniques/T1614)). Adversaries may also use knowledge of system time as part of a time bomb, or delaying execution until a specified date/time.(Citation: AnyRun TimeBomb)",
    "tactic": "discovery",
    "technique_name": "System Time Discovery",
    "technique_id": "T1124",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1124: System Time Discovery'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1124: System Time Discovery'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1124: System Time Discovery'"
      }
    ],
    "ability_id": "attack-pattern--f3c544dc-673c-4ef3-accb-53229f1ae077"
  },
  {
    "id": "attack-pattern--c3d4bdd9-2cfe-4a80-9d0c-07a29ecdce8f",
    "name": "Domain Accounts",
    "description": "Adversaries may obtain and abuse credentials of a domain account as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion.(Citation: TechNet Credential Theft) Domain accounts are those managed by Active Directory Domain Services where access and permissions are configured across systems and services that are part of that domain. Domain accounts can cover users, administrators, and services.(Citation: Microsoft AD Accounts)\n\nAdversaries may compromise domain accounts, some with a high level of privileges, through various means such as [OS Credential Dumping](https://attack.mitre.org/techniques/T1003) or password reuse, allowing access to privileged resources of the domain.",
    "tactic": "defense-evasion",
    "technique_name": "Domain Accounts",
    "technique_id": "T1078.002",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1078.002: Domain Accounts'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1078.002: Domain Accounts'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1078.002: Domain Accounts'"
      }
    ],
    "ability_id": "attack-pattern--c3d4bdd9-2cfe-4a80-9d0c-07a29ecdce8f"
  },
  {
    "id": "attack-pattern--707399d6-ab3e-4963-9315-d9d3818cd6a0",
    "name": "System Network Configuration Discovery",
    "description": "Adversaries may look for details about the network configuration and settings, such as IP and/or MAC addresses, of systems they access or through information discovery of remote systems. Several operating system administration utilities exist that can be used to gather this information. Examples include [Arp](https://attack.mitre.org/software/S0099), [ipconfig](https://attack.mitre.org/software/S0100)/[ifconfig](https://attack.mitre.org/software/S0101), [nbtstat](https://attack.mitre.org/software/S0102), and [route](https://attack.mitre.org/software/S0103).\n\nAdversaries may also leverage a [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) on network devices to gather information about configurations and settings, such as IP addresses of configured interfaces and static/dynamic routes (e.g. <code>show ip route</code>, <code>show ip interface</code>).(Citation: US-CERT-TA18-106A)(Citation: Mandiant APT41 Global Intrusion ) On ESXi, adversaries may leverage esxcli to gather network configuration information. For example, the command `esxcli network nic list` will retrieve the MAC address, while `esxcli network ip interface ipv4 get` will retrieve the local IPv4 address.(Citation: Trellix Rnasomhouse 2024)\n\nAdversaries may use the information from [System Network Configuration Discovery](https://attack.mitre.org/techniques/T1016) during automated discovery to shape follow-on behaviors, including determining certain access within the target network and what actions to do next. ",
    "tactic": "discovery",
    "technique_name": "System Network Configuration Discovery",
    "technique_id": "T1016",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1016: System Network Configuration Discovery'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1016: System Network Configuration Discovery'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1016: System Network Configuration Discovery'"
      }
    ],
    "ability_id": "attack-pattern--707399d6-ab3e-4963-9315-d9d3818cd6a0"
  },
  {
    "id": "attack-pattern--b6075259-dba3-44e9-87c7-e954f37ec0d5",
    "name": "Password Policy Discovery",
    "description": "Adversaries may attempt to access detailed information about the password policy used within an enterprise network or cloud environment. Password policies are a way to enforce complex passwords that are difficult to guess or crack through [Brute Force](https://attack.mitre.org/techniques/T1110). This information may help the adversary to create a list of common passwords and launch dictionary and/or brute force attacks which adheres to the policy (e.g. if the minimum password length should be 8, then not trying passwords such as 'pass123'; not checking for more than 3-4 passwords per account if the lockout is set to 6 as to not lock out accounts).\n\nPassword policies can be set and discovered on Windows, Linux, and macOS systems via various command shell utilities such as <code>net accounts (/domain)</code>, <code>Get-ADDefaultDomainPasswordPolicy</code>, <code>chage -l <username></code>, <code>cat /etc/pam.d/common-password</code>, and <code>pwpolicy getaccountpolicies</code> (Citation: Superuser Linux Password Policies) (Citation: Jamf User Password Policies). Adversaries may also leverage a [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) on network devices to discover password policy information (e.g. <code>show aaa</code>, <code>show aaa common-criteria policy all</code>).(Citation: US-CERT-TA18-106A)\n\nPassword policies can be discovered in cloud environments using available APIs such as <code>GetAccountPasswordPolicy</code> in AWS (Citation: AWS GetPasswordPolicy).",
    "tactic": "discovery",
    "technique_name": "Password Policy Discovery",
    "technique_id": "T1201",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1201: Password Policy Discovery'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1201: Password Policy Discovery'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1201: Password Policy Discovery'"
      }
    ],
    "ability_id": "attack-pattern--b6075259-dba3-44e9-87c7-e954f37ec0d5"
  },
  {
    "id": "attack-pattern--a2fdce72-04b2-409a-ac10-cc1695f4fce0",
    "name": "Tool",
    "description": "Adversaries may buy, steal, or download software tools that can be used during targeting. Tools can be open or closed source, free or commercial. A tool can be used for malicious purposes by an adversary, but (unlike malware) were not intended to be used for those purposes (ex: [PsExec](https://attack.mitre.org/software/S0029)). \n\nAdversaries may obtain tools to support their operations, including to support execution of post-compromise behaviors. Tools may also be leveraged for testing – for example, evaluating malware against commercial antivirus or endpoint detection and response (EDR) applications.(Citation: Forescout Conti Leaks 2022)(Citation: Sentinel Labs Top Tier Target 2025)\n\nTool acquisition may involve the procurement of commercial software licenses, including for red teaming tools such as Cobalt Strike. In addition to freely downloading or purchasing software, adversaries may steal software and/or software licenses from third-party entities (including other adversaries). Threat actors may also crack trial versions of software.(Citation: Recorded Future Beacon 2019)",
    "tactic": "resource-development",
    "technique_name": "Tool",
    "technique_id": "T1588.002",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1588.002: Tool'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1588.002: Tool'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1588.002: Tool'"
      }
    ],
    "ability_id": "attack-pattern--a2fdce72-04b2-409a-ac10-cc1695f4fce0"
  },
  {
    "id": "attack-pattern--1c4e5d32-1fe9-4116-9d9d-59e3925bd6a2",
    "name": "Match Legitimate Resource Name or Location",
    "description": "Adversaries may match or approximate the name or location of legitimate files, Registry keys, or other resources when naming/placing them. This is done for the sake of evading defenses and observation. \n\nThis may be done by placing an executable in a commonly trusted directory (ex: under System32) or giving it the name of a legitimate, trusted program (ex: `svchost.exe`). Alternatively, a Windows Registry key may be given a close approximation to a key used by a legitimate program. In containerized environments, a threat actor may create a resource in a trusted namespace or one that matches the naming convention of a container pod or cluster.(Citation: Aquasec Kubernetes Backdoor 2023)",
    "tactic": "defense-evasion",
    "technique_name": "Match Legitimate Resource Name or Location",
    "technique_id": "T1036.005",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1036.005: Match Legitimate Resource Name or Location'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1036.005: Match Legitimate Resource Name or Location'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1036.005: Match Legitimate Resource Name or Location'"
      }
    ],
    "ability_id": "attack-pattern--1c4e5d32-1fe9-4116-9d9d-59e3925bd6a2"
  },
  {
    "id": "attack-pattern--25659dd6-ea12-45c4-97e6-381e3e4b593e",
    "name": "Local Account",
    "description": "Adversaries may attempt to get a listing of local system accounts. This information can help adversaries determine which local accounts exist on a system to aid in follow-on behavior.\n\nCommands such as <code>net user</code> and <code>net localgroup</code> of the [Net](https://attack.mitre.org/software/S0039) utility and <code>id</code> and <code>groups</code> on macOS and Linux can list local users and groups.(Citation: Mandiant APT1)(Citation: id man page)(Citation: groups man page) On Linux, local users can also be enumerated through the use of the <code>/etc/passwd</code> file. On macOS, the <code>dscl . list /Users</code> command can be used to enumerate local accounts. On ESXi servers, the `esxcli system account list` command can list local user accounts.(Citation: Crowdstrike Hypervisor Jackpotting Pt 2 2021)",
    "tactic": "discovery",
    "technique_name": "Local Account",
    "technique_id": "T1087.001",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1087.001: Local Account'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1087.001: Local Account'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1087.001: Local Account'"
      }
    ],
    "ability_id": "attack-pattern--25659dd6-ea12-45c4-97e6-381e3e4b593e"
  },
  {
    "id": "attack-pattern--03d7999c-1f4c-42cc-8373-e7690d318104",
    "name": "System Owner/User Discovery",
    "description": "Adversaries may attempt to identify the primary user, currently logged in user, set of users that commonly uses a system, or whether a user is actively using the system. They may do this, for example, by retrieving account usernames or by using [OS Credential Dumping](https://attack.mitre.org/techniques/T1003). The information may be collected in a number of different ways using other Discovery techniques, because user and username details are prevalent throughout a system and include running process ownership, file/directory ownership, session information, and system logs. Adversaries may use the information from [System Owner/User Discovery](https://attack.mitre.org/techniques/T1033) during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\n\nVarious utilities and commands may acquire this information, including <code>whoami</code>. In macOS and Linux, the currently logged in user can be identified with <code>w</code> and <code>who</code>. On macOS the <code>dscl . list /Users | grep -v '_'</code> command can also be used to enumerate user accounts. Environment variables, such as <code>%USERNAME%</code> and <code>$USER</code>, may also be used to access this information.\n\nOn network devices, [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) commands such as `show users` and `show ssh` can be used to display users currently logged into the device.(Citation: show_ssh_users_cmd_cisco)(Citation: US-CERT TA18-106A Network Infrastructure Devices 2018)",
    "tactic": "discovery",
    "technique_name": "System Owner/User Discovery",
    "technique_id": "T1033",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1033: System Owner/User Discovery'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1033: System Owner/User Discovery'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1033: System Owner/User Discovery'"
      }
    ],
    "ability_id": "attack-pattern--03d7999c-1f4c-42cc-8373-e7690d318104"
  },
  {
    "id": "attack-pattern--d511a6f6-4a33-41d5-bc95-c343875d1377",
    "name": "Command Obfuscation",
    "description": "Adversaries may obfuscate content during command execution to impede detection. Command-line obfuscation is a method of making strings and patterns within commands and scripts more difficult to signature and analyze. This type of obfuscation can be included within commands executed by delivered payloads (e.g., [Phishing](https://attack.mitre.org/techniques/T1566) and [Drive-by Compromise](https://attack.mitre.org/techniques/T1189)) or interactively via [Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059).(Citation: Akamai JS)(Citation: Malware Monday VBE)\n\nFor example, adversaries may abuse syntax that utilizes various symbols and escape characters (such as spacing,  `^`, `+`. `$`, and `%`) to make commands difficult to analyze while maintaining the same intended functionality.(Citation: RC PowerShell) Many languages support built-in obfuscation in the form of base64 or URL encoding.(Citation: Microsoft PowerShellB64) Adversaries may also manually implement command obfuscation via string splitting (`“Wor”+“d.Application”`), order and casing of characters (`rev <<<'dwssap/cte/ tac'`), globing (`mkdir -p '/tmp/:&$NiA'`), as well as various tricks involving passing strings through tokens/environment variables/input streams.(Citation: Bashfuscator Command Obfuscators)(Citation: FireEye Obfuscation June 2017)\n\nAdversaries may also use tricks such as directory traversals to obfuscate references to the binary being invoked by a command (`C:\\voi\\pcw\\..\\..\\Windows\\tei\\qs\\k\\..\\..\\..\\system32\\erool\\..\\wbem\\wg\\je\\..\\..\\wmic.exe shadowcopy delete`).(Citation: Twitter Richard WMIC)\n\nTools such as <code>Invoke-Obfuscation</code> and <code>Invoke-DOSfucation</code> have also been used to obfuscate commands.(Citation: Invoke-DOSfuscation)(Citation: Invoke-Obfuscation)",
    "tactic": "defense-evasion",
    "technique_name": "Command Obfuscation",
    "technique_id": "T1027.010",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1027.010: Command Obfuscation'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1027.010: Command Obfuscation'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1027.010: Command Obfuscation'"
      }
    ],
    "ability_id": "attack-pattern--d511a6f6-4a33-41d5-bc95-c343875d1377"
  },
  {
    "id": "attack-pattern--21875073-b0ee-49e3-9077-1e2a885359af",
    "name": "Domain Account",
    "description": "Adversaries may attempt to get a listing of domain accounts. This information can help adversaries determine which domain accounts exist to aid in follow-on behavior such as targeting specific accounts which possess particular privileges.\n\nCommands such as <code>net user /domain</code> and <code>net group /domain</code> of the [Net](https://attack.mitre.org/software/S0039) utility, <code>dscacheutil -q group</code> on macOS, and <code>ldapsearch</code> on Linux can list domain users and groups. [PowerShell](https://attack.mitre.org/techniques/T1059/001) cmdlets including <code>Get-ADUser</code> and <code>Get-ADGroupMember</code> may enumerate members of Active Directory groups.(Citation: CrowdStrike StellarParticle January 2022)  ",
    "tactic": "discovery",
    "technique_name": "Domain Account",
    "technique_id": "T1087.002",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1087.002: Domain Account'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1087.002: Domain Account'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1087.002: Domain Account'"
      }
    ],
    "ability_id": "attack-pattern--21875073-b0ee-49e3-9077-1e2a885359af"
  },
  {
    "id": "attack-pattern--005a06c6-14bf-4118-afa0-ebcd8aebb0c9",
    "name": "Scheduled Task",
    "description": "Adversaries may abuse the Windows Task Scheduler to perform task scheduling for initial or recurring execution of malicious code. There are multiple ways to access the Task Scheduler in Windows. The [schtasks](https://attack.mitre.org/software/S0111) utility can be run directly on the command line, or the Task Scheduler can be opened through the GUI within the Administrator Tools section of the Control Panel.(Citation: Stack Overflow) In some cases, adversaries have used a .NET wrapper for the Windows Task Scheduler, and alternatively, adversaries have used the Windows netapi32 library and [Windows Management Instrumentation](https://attack.mitre.org/techniques/T1047) (WMI) to create a scheduled task. Adversaries may also utilize the Powershell Cmdlet `Invoke-CimMethod`, which leverages WMI class `PS_ScheduledTask` to create a scheduled task via an XML path.(Citation: Red Canary - Atomic Red Team)\n\nAn adversary may use Windows Task Scheduler to execute programs at system startup or on a scheduled basis for persistence. The Windows Task Scheduler can also be abused to conduct remote Execution as part of Lateral Movement and/or to run a process under the context of a specified account (such as SYSTEM). Similar to [System Binary Proxy Execution](https://attack.mitre.org/techniques/T1218), adversaries have also abused the Windows Task Scheduler to potentially mask one-time execution under signed/trusted system processes.(Citation: ProofPoint Serpent)\n\nAdversaries may also create \"hidden\" scheduled tasks (i.e. [Hide Artifacts](https://attack.mitre.org/techniques/T1564)) that may not be visible to defender tools and manual queries used to enumerate tasks. Specifically, an adversary may hide a task from `schtasks /query` and the Task Scheduler by deleting the associated Security Descriptor (SD) registry value (where deletion of this value must be completed using SYSTEM permissions).(Citation: SigmaHQ)(Citation: Tarrask scheduled task) Adversaries may also employ alternate methods to hide tasks, such as altering the metadata (e.g., `Index` value) within associated registry keys.(Citation: Defending Against Scheduled Task Attacks in Windows Environments) ",
    "tactic": "execution",
    "technique_name": "Scheduled Task",
    "technique_id": "T1053.005",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1053.005: Scheduled Task'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1053.005: Scheduled Task'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1053.005: Scheduled Task'"
      }
    ],
    "ability_id": "attack-pattern--005a06c6-14bf-4118-afa0-ebcd8aebb0c9"
  },
  {
    "id": "attack-pattern--3f886f2a-874f-4333-b794-aa6075009b1c",
    "name": "Exploit Public-Facing Application",
    "description": "Adversaries may attempt to exploit a weakness in an Internet-facing host or system to initially access a network. The weakness in the system can be a software bug, a temporary glitch, or a misconfiguration.\n\nExploited applications are often websites/web servers, but can also include databases (like SQL), standard services (like SMB or SSH), network device administration and management protocols (like SNMP and Smart Install), and any other system with Internet-accessible open sockets.(Citation: NVD CVE-2016-6662)(Citation: CIS Multiple SMB Vulnerabilities)(Citation: US-CERT TA18-106A Network Infrastructure Devices 2018)(Citation: Cisco Blog Legacy Device Attacks)(Citation: NVD CVE-2014-7169) On ESXi infrastructure, adversaries may exploit exposed OpenSLP services; they may alternatively exploit exposed VMware vCenter servers.(Citation: Recorded Future ESXiArgs Ransomware 2023)(Citation: Ars Technica VMWare Code Execution Vulnerability 2021) Depending on the flaw being exploited, this may also involve [Exploitation for Defense Evasion](https://attack.mitre.org/techniques/T1211) or [Exploitation for Client Execution](https://attack.mitre.org/techniques/T1203).\n\nIf an application is hosted on cloud-based infrastructure and/or is containerized, then exploiting it may lead to compromise of the underlying instance or container. This can allow an adversary a path to access the cloud or container APIs (e.g., via the [Cloud Instance Metadata API](https://attack.mitre.org/techniques/T1552/005)), exploit container host access via [Escape to Host](https://attack.mitre.org/techniques/T1611), or take advantage of weak identity and access management policies.\n\nAdversaries may also exploit edge network infrastructure and related appliances, specifically targeting devices that do not support robust host-based defenses.(Citation: Mandiant Fortinet Zero Day)(Citation: Wired Russia Cyberwar)\n\nFor websites and databases, the OWASP top 10 and CWE top 25 highlight the most common web-based vulnerabilities.(Citation: OWASP Top 10)(Citation: CWE top 25)",
    "tactic": "initial-access",
    "technique_name": "Exploit Public-Facing Application",
    "technique_id": "T1190",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1190: Exploit Public-Facing Application'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1190: Exploit Public-Facing Application'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1190: Exploit Public-Facing Application'"
      }
    ],
    "ability_id": "attack-pattern--3f886f2a-874f-4333-b794-aa6075009b1c"
  },
  {
    "id": "attack-pattern--a01bf75f-00b2-4568-a58f-565ff9bf202b",
    "name": "Local Groups",
    "description": "Adversaries may attempt to find local system groups and permission settings. The knowledge of local system permission groups can help adversaries determine which groups exist and which users belong to a particular group. Adversaries may use this information to determine which users have elevated permissions, such as the users found within the local administrators group.\n\nCommands such as <code>net localgroup</code> of the [Net](https://attack.mitre.org/software/S0039) utility, <code>dscl . -list /Groups</code> on macOS, and <code>groups</code> on Linux can list local groups.",
    "tactic": "discovery",
    "technique_name": "Local Groups",
    "technique_id": "T1069.001",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1069.001: Local Groups'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1069.001: Local Groups'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1069.001: Local Groups'"
      }
    ],
    "ability_id": "attack-pattern--a01bf75f-00b2-4568-a58f-565ff9bf202b"
  },
  {
    "id": "attack-pattern--02c5abff-30bf-4703-ab92-1f6072fae939",
    "name": "Fileless Storage",
    "description": "Adversaries may store data in \"fileless\" formats to conceal malicious activity from defenses. Fileless storage can be broadly defined as any format other than a file. Common examples of non-volatile fileless storage in Windows systems include the Windows Registry, event logs, or WMI repository.(Citation: Microsoft Fileless)(Citation: SecureList Fileless) Shared memory directories on Linux systems (`/dev/shm`, `/run/shm`, `/var/run`, and `/var/lock`) and volatile directories on Network Devices (`/tmp` and `/volatile`) may also be considered fileless storage, as files written to these directories are mapped directly to RAM and not stored on the disk.(Citation: Elastic Binary Executed from Shared Memory Directory)(Citation: Akami Frog4Shell 2024)(Citation: Aquasec Muhstik Malware 2024)(Citation: Bitsight 7777 Botnet)(Citation: CISCO Nexus 900 Config).\n\nSimilar to fileless in-memory behaviors such as [Reflective Code Loading](https://attack.mitre.org/techniques/T1620) and [Process Injection](https://attack.mitre.org/techniques/T1055), fileless data storage may remain undetected by anti-virus and other endpoint security tools that can only access specific file formats from disk storage. Leveraging fileless storage may also allow adversaries to bypass the protections offered by read-only file systems in Linux.(Citation: Sysdig Fileless Malware 23022)\n\nAdversaries may use fileless storage to conceal various types of stored data, including payloads/shellcode (potentially being used as part of [Persistence](https://attack.mitre.org/tactics/TA0003)) and collected data not yet exfiltrated from the victim (e.g., [Local Data Staging](https://attack.mitre.org/techniques/T1074/001)). Adversaries also often encrypt, encode, splice, or otherwise obfuscate this fileless data when stored. \n\nSome forms of fileless storage activity may indirectly create artifacts in the file system, but in central and otherwise difficult to inspect formats such as the WMI (e.g., `%SystemRoot%\\System32\\Wbem\\Repository`) or Registry (e.g., `%SystemRoot%\\System32\\Config`) physical files.(Citation: Microsoft Fileless) ",
    "tactic": "defense-evasion",
    "technique_name": "Fileless Storage",
    "technique_id": "T1027.011",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1027.011: Fileless Storage'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1027.011: Fileless Storage'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1027.011: Fileless Storage'"
      }
    ],
    "ability_id": "attack-pattern--02c5abff-30bf-4703-ab92-1f6072fae939"
  },
  {
    "id": "attack-pattern--d1fcf083-a721-4223-aedf-bf8960798d62",
    "name": "Windows Command Shell",
    "description": "Adversaries may abuse the Windows command shell for execution. The Windows command shell ([cmd](https://attack.mitre.org/software/S0106)) is the primary command prompt on Windows systems. The Windows command prompt can be used to control almost any aspect of a system, with various permission levels required for different subsets of commands. The command prompt can be invoked remotely via [Remote Services](https://attack.mitre.org/techniques/T1021) such as [SSH](https://attack.mitre.org/techniques/T1021/004).(Citation: SSH in Windows)\n\nBatch files (ex: .bat or .cmd) also provide the shell with a list of sequential commands to run, as well as normal scripting operations such as conditionals and loops. Common uses of batch files include long or repetitive tasks, or the need to run the same set of commands on multiple systems.\n\nAdversaries may leverage [cmd](https://attack.mitre.org/software/S0106) to execute various commands and payloads. Common uses include [cmd](https://attack.mitre.org/software/S0106) to execute a single command, or abusing [cmd](https://attack.mitre.org/software/S0106) interactively with input and output forwarded over a command and control channel.",
    "tactic": "execution",
    "technique_name": "Windows Command Shell",
    "technique_id": "T1059.003",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1059.003: Windows Command Shell'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1059.003: Windows Command Shell'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1059.003: Windows Command Shell'"
      }
    ],
    "ability_id": "attack-pattern--d1fcf083-a721-4223-aedf-bf8960798d62"
  },
  {
    "id": "attack-pattern--5d0d3609-d06d-49e1-b9c9-b544e0c618cb",
    "name": "Web Shell",
    "description": "Adversaries may backdoor web servers with web shells to establish persistent access to systems. A Web shell is a Web script that is placed on an openly accessible Web server to allow an adversary to access the Web server as a gateway into a network. A Web shell may provide a set of functions to execute or a command-line interface on the system that hosts the Web server.(Citation: volexity_0day_sophos_FW)\n\nIn addition to a server-side script, a Web shell may have a client interface program that is used to talk to the Web server (e.g. [China Chopper](https://attack.mitre.org/software/S0020) Web shell client).(Citation: Lee 2013)",
    "tactic": "persistence",
    "technique_name": "Web Shell",
    "technique_id": "T1505.003",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1505.003: Web Shell'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1505.003: Web Shell'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1505.003: Web Shell'"
      }
    ],
    "ability_id": "attack-pattern--5d0d3609-d06d-49e1-b9c9-b544e0c618cb"
  },
  {
    "id": "attack-pattern--1644e709-12d2-41e5-a60f-3470991f5011",
    "name": "Security Account Manager",
    "description": "Adversaries may attempt to extract credential material from the Security Account Manager (SAM) database either through in-memory techniques or through the Windows Registry where the SAM database is stored. The SAM is a database file that contains local accounts for the host, typically those found with the <code>net user</code> command. Enumerating the SAM database requires SYSTEM level access.\n\nA number of tools can be used to retrieve the SAM file through in-memory techniques:\n\n* pwdumpx.exe\n* [gsecdump](https://attack.mitre.org/software/S0008)\n* [Mimikatz](https://attack.mitre.org/software/S0002)\n* secretsdump.py\n\nAlternatively, the SAM can be extracted from the Registry with Reg:\n\n* <code>reg save HKLM\\sam sam</code>\n* <code>reg save HKLM\\system system</code>\n\nCreddump7 can then be used to process the SAM database locally to retrieve hashes.(Citation: GitHub Creddump7)\n\nNotes: \n\n* RID 500 account is the local, built-in administrator.\n* RID 501 is the guest account.\n* User accounts start with a RID of 1,000+.\n",
    "tactic": "credential-access",
    "technique_name": "Security Account Manager",
    "technique_id": "T1003.002",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1003.002: Security Account Manager'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1003.002: Security Account Manager'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1003.002: Security Account Manager'"
      }
    ],
    "ability_id": "attack-pattern--1644e709-12d2-41e5-a60f-3470991f5011"
  },
  {
    "id": "attack-pattern--df8b2a25-8bdf-4856-953c-a04372b1c161",
    "name": "Web Protocols",
    "description": "Adversaries may communicate using application layer protocols associated with web traffic to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \n\nProtocols such as HTTP/S(Citation: CrowdStrike Putter Panda) and WebSocket(Citation: Brazking-Websockets) that carry web traffic may be very common in environments. HTTP/S packets have many fields and headers in which data can be concealed. An adversary may abuse these protocols to communicate with systems under their control within a victim network while also mimicking normal, expected traffic. ",
    "tactic": "command-and-control",
    "technique_name": "Web Protocols",
    "technique_id": "T1071.001",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1071.001: Web Protocols'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1071.001: Web Protocols'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1071.001: Web Protocols'"
      }
    ],
    "ability_id": "attack-pattern--df8b2a25-8bdf-4856-953c-a04372b1c161"
  },
  {
    "id": "attack-pattern--7e150503-88e7-4861-866b-ff1ac82c4475",
    "name": "System Network Connections Discovery",
    "description": "Adversaries may attempt to get a listing of network connections to or from the compromised system they are currently accessing or from remote systems by querying for information over the network. \n\nAn adversary who gains access to a system that is part of a cloud-based environment may map out Virtual Private Clouds or Virtual Networks in order to determine what systems and services are connected. The actions performed are likely the same types of discovery techniques depending on the operating system, but the resulting information may include details about the networked cloud environment relevant to the adversary's goals. Cloud providers may have different ways in which their virtual networks operate.(Citation: Amazon AWS VPC Guide)(Citation: Microsoft Azure Virtual Network Overview)(Citation: Google VPC Overview) Similarly, adversaries who gain access to network devices may also perform similar discovery activities to gather information about connected systems and services.\n\nUtilities and commands that acquire this information include [netstat](https://attack.mitre.org/software/S0104), \"net use,\" and \"net session\" with [Net](https://attack.mitre.org/software/S0039). In Mac and Linux, [netstat](https://attack.mitre.org/software/S0104) and <code>lsof</code> can be used to list current connections. <code>who -a</code> and <code>w</code> can be used to show which users are currently logged in, similar to \"net session\". Additionally, built-in features native to network devices and [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) may be used (e.g. <code>show ip sockets</code>, <code>show tcp brief</code>).(Citation: US-CERT-TA18-106A) On ESXi servers, the command `esxi network ip connection list` can be used to list active network connections.(Citation: Sygnia ESXi Ransomware 2025)",
    "tactic": "discovery",
    "technique_name": "System Network Connections Discovery",
    "technique_id": "T1049",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1049: System Network Connections Discovery'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1049: System Network Connections Discovery'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1049: System Network Connections Discovery'"
      }
    ],
    "ability_id": "attack-pattern--7e150503-88e7-4861-866b-ff1ac82c4475"
  },
  {
    "id": "attack-pattern--dfd7cc1d-e1d8-4394-a198-97c4cab8aa67",
    "name": "Visual Basic",
    "description": "Adversaries may abuse Visual Basic (VB) for execution. VB is a programming language created by Microsoft with interoperability with many Windows technologies such as [Component Object Model](https://attack.mitre.org/techniques/T1559/001) and the [Native API](https://attack.mitre.org/techniques/T1106) through the Windows API. Although tagged as legacy with no planned future evolutions, VB is integrated and supported in the .NET Framework and cross-platform .NET Core.(Citation: VB .NET Mar 2020)(Citation: VB Microsoft)\n\nDerivative languages based on VB have also been created, such as Visual Basic for Applications (VBA) and VBScript. VBA is an event-driven programming language built into Microsoft Office, as well as several third-party applications.(Citation: Microsoft VBA)(Citation: Wikipedia VBA) VBA enables documents to contain macros used to automate the execution of tasks and other functionality on the host. VBScript is a default scripting language on Windows hosts and can also be used in place of [JavaScript](https://attack.mitre.org/techniques/T1059/007) on HTML Application (HTA) webpages served to Internet Explorer (though most modern browsers do not come with VBScript support).(Citation: Microsoft VBScript)\n\nAdversaries may use VB payloads to execute malicious commands. Common malicious usage includes automating execution of behaviors with VBScript or embedding VBA content into [Spearphishing Attachment](https://attack.mitre.org/techniques/T1566/001) payloads (which may also involve [Mark-of-the-Web Bypass](https://attack.mitre.org/techniques/T1553/005) to enable execution).(Citation: Default VBS macros Blocking )",
    "tactic": "execution",
    "technique_name": "Visual Basic",
    "technique_id": "T1059.005",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1059.005: Visual Basic'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1059.005: Visual Basic'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1059.005: Visual Basic'"
      }
    ],
    "ability_id": "attack-pattern--dfd7cc1d-e1d8-4394-a198-97c4cab8aa67"
  },
  {
    "id": "attack-pattern--3489cfc5-640f-4bb3-a103-9137b97de79f",
    "name": "Network Share Discovery",
    "description": "Adversaries may look for folders and drives shared on remote systems as a means of identifying sources of information to gather as a precursor for Collection and to identify potential systems of interest for Lateral Movement. Networks often contain shared network drives and folders that enable users to access file directories on various systems across a network. \n\nFile sharing over a Windows network occurs over the SMB protocol. (Citation: Wikipedia Shared Resource) (Citation: TechNet Shared Folder) [Net](https://attack.mitre.org/software/S0039) can be used to query a remote system for available shared drives using the <code>net view \\\\\\\\remotesystem</code> command. It can also be used to query shared drives on the local system using <code>net share</code>. For macOS, the <code>sharing -l</code> command lists all shared points used for smb services.",
    "tactic": "discovery",
    "technique_name": "Network Share Discovery",
    "technique_id": "T1135",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1135: Network Share Discovery'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1135: Network Share Discovery'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1135: Network Share Discovery'"
      }
    ],
    "ability_id": "attack-pattern--3489cfc5-640f-4bb3-a103-9137b97de79f"
  },
  {
    "id": "attack-pattern--2fee9321-3e71-4cf4-af24-d4d40d355b34",
    "name": "DLL",
    "description": "Adversaries may abuse dynamic-link library files (DLLs) in order to achieve persistence, escalate privileges, and evade defenses. DLLs are libraries that contain code and data that can be simultaneously utilized by multiple programs. While DLLs are not malicious by nature, they can be abused through mechanisms such as side-loading, hijacking search order, and phantom DLL hijacking.(Citation: unit 42)\n\nSpecific ways DLLs are abused by adversaries include:\n\n### DLL Sideloading\nAdversaries may execute their own malicious payloads by side-loading DLLs. Side-loading involves hijacking which DLL a program loads by planting and then invoking a legitimate application that executes their payload(s).\n\nSide-loading positions both the victim application and malicious payload(s) alongside each other. Adversaries likely use side-loading as a means of masking actions they perform under a legitimate, trusted, and potentially elevated system or software process. Benign executables used to side-load payloads may not be flagged during delivery and/or execution. Adversary payloads may also be encrypted/packed or otherwise obfuscated until loaded into the memory of the trusted process.\n\nAdversaries may also side-load other packages, such as BPLs (Borland Package Library).(Citation: kroll bpl)\n\nAdversaries may chain DLL sideloading multiple times to fragment functionality hindering analysis. Adversaries using multiple DLL files can split the loader functions across different DLLs, with a main DLL loading the separated export functions. (Citation: Virus Bulletin) Spreading loader functions across multiple DLLs makes analysis harder, since all files must be collected to fully understand the malware’s behavior.  Another method implements a “loader-for-a-loader”, where a malicious DLL’s sole role is to load a second DLL (or a chain of DLLs) that contain the real payload. (Citation: Sophos)\n\n### DLL Search Order Hijacking\nAdversaries may execute their own malicious payloads by hijacking the search order that Windows uses to load DLLs. This search order is a sequence of special and standard search locations that a program checks when loading a DLL. An adversary can plant a trojan DLL in a directory that will be prioritized by the DLL search order over the location of a legitimate library. This will cause Windows to load the malicious DLL when it is called for by the victim program.(Citation: unit 42)\n\n### DLL Redirection\nAdversaries may directly modify the search order via DLL redirection, which after being enabled (in the Registry or via the creation of a redirection file) may cause a program to load a DLL from a different location.(Citation: Microsoft redirection)(Citation: Microsoft - manifests/assembly)\n\n### Phantom DLL Hijacking\nAdversaries may leverage phantom DLL hijacking by targeting references to non-existent DLL files. They may be able to load their own malicious DLL by planting it with the correct name in the location of the missing module.(Citation: Hexacorn DLL Hijacking)(Citation: Hijack DLLs CrowdStrike)\n\n### DLL Substitution\nAdversaries may target existing, valid DLL files and substitute them with their own malicious DLLs, planting them with the same name and in the same location as the valid DLL file.(Citation: Wietze Beukema DLL Hijacking)\n\nPrograms that fall victim to DLL hijacking may appear to behave normally because malicious DLLs may be configured to also load the legitimate DLLs they were meant to replace, evading defenses.\n\nRemote DLL hijacking can occur when a program sets its current directory to a remote location, such as a Web share, before loading a DLL.(Citation: dll pre load owasp)(Citation: microsoft remote preloading)\n\nIf a valid DLL is configured to run at a higher privilege level, then the adversary-controlled DLL that is loaded will also be executed at the higher level. In this case, the technique could be used for privilege escalation.",
    "tactic": "persistence",
    "technique_name": "DLL",
    "technique_id": "T1574.001",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1574.001: DLL'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1574.001: DLL'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1574.001: DLL'"
      }
    ],
    "ability_id": "attack-pattern--2fee9321-3e71-4cf4-af24-d4d40d355b34"
  },
  {
    "id": "attack-pattern--8f4a33ec-8b1f-4b80-a2f6-642b2e479580",
    "name": "Process Discovery",
    "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from [Process Discovery](https://attack.mitre.org/techniques/T1057) during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\n\nIn Windows environments, adversaries could obtain details on running processes using the [Tasklist](https://attack.mitre.org/software/S0057) utility via [cmd](https://attack.mitre.org/software/S0106) or <code>Get-Process</code> via [PowerShell](https://attack.mitre.org/techniques/T1059/001). Information about processes can also be extracted from the output of [Native API](https://attack.mitre.org/techniques/T1106) calls such as <code>CreateToolhelp32Snapshot</code>. In Mac and Linux, this is accomplished with the <code>ps</code> command. Adversaries may also opt to enumerate processes via `/proc`. ESXi also supports use of the `ps` command, as well as `esxcli system process list`.(Citation: Sygnia ESXi Ransomware 2025)(Citation: Crowdstrike Hypervisor Jackpotting Pt 2 2021)\n\nOn network devices, [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) commands such as `show processes` can be used to display current running processes.(Citation: US-CERT-TA18-106A)(Citation: show_processes_cisco_cmd)",
    "tactic": "discovery",
    "technique_name": "Process Discovery",
    "technique_id": "T1057",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1057: Process Discovery'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1057: Process Discovery'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1057: Process Discovery'"
      }
    ],
    "ability_id": "attack-pattern--8f4a33ec-8b1f-4b80-a2f6-642b2e479580"
  },
  {
    "id": "attack-pattern--a1b52199-c8c5-438a-9ded-656f1d0888c6",
    "name": "Kernel Modules and Extensions",
    "description": "Adversaries may modify the kernel to automatically execute programs on system boot. Loadable Kernel Modules (LKMs) are pieces of code that can be loaded and unloaded into the kernel upon demand. They extend the functionality of the kernel without the need to reboot the system. For example, one type of module is the device driver, which allows the kernel to access hardware connected to the system.(Citation: Linux Kernel Programming) \n\nWhen used maliciously, LKMs can be a type of kernel-mode [Rootkit](https://attack.mitre.org/techniques/T1014) that run with the highest operating system privilege (Ring 0).(Citation: Linux Kernel Module Programming Guide) Common features of LKM based rootkits include: hiding itself, selective hiding of files, processes and network activity, as well as log tampering, providing authenticated backdoors, and enabling root access to non-privileged users.(Citation: iDefense Rootkit Overview)\n\nKernel extensions, also called kext, are used in macOS to load functionality onto a system similar to LKMs for Linux. Since the kernel is responsible for enforcing security and the kernel extensions run as apart of the kernel, kexts are not governed by macOS security policies. Kexts are loaded and unloaded through <code>kextload</code> and <code>kextunload</code> commands. Kexts need to be signed with a developer ID that is granted privileges by Apple allowing it to sign Kernel extensions. Developers without these privileges may still sign kexts but they will not load unless SIP is disabled. If SIP is enabled, the kext signature is verified before being added to the AuxKC.(Citation: System and kernel extensions in macOS)\n\nSince macOS Catalina 10.15, kernel extensions have been deprecated in favor of System Extensions. However, kexts are still allowed as \"Legacy System Extensions\" since there is no System Extension for Kernel Programming Interfaces.(Citation: Apple Kernel Extension Deprecation)\n\nAdversaries can use LKMs and kexts to conduct [Persistence](https://attack.mitre.org/tactics/TA0003) and/or [Privilege Escalation](https://attack.mitre.org/tactics/TA0004) on a system. Examples have been found in the wild, and there are some relevant open source projects as well.(Citation: Volatility Phalanx2)(Citation: CrowdStrike Linux Rootkit)(Citation: GitHub Reptile)(Citation: GitHub Diamorphine)(Citation: RSAC 2015 San Francisco Patrick Wardle)(Citation: Synack Secure Kernel Extension Broken)(Citation: Securelist Ventir)(Citation: Trend Micro Skidmap)",
    "tactic": "persistence",
    "technique_name": "Kernel Modules and Extensions",
    "technique_id": "T1547.006",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1547.006: Kernel Modules and Extensions'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1547.006: Kernel Modules and Extensions'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1547.006: Kernel Modules and Extensions'"
      }
    ],
    "ability_id": "attack-pattern--a1b52199-c8c5-438a-9ded-656f1d0888c6"
  },
  {
    "id": "attack-pattern--322bad5a-1c49-4d23-ab79-76d641794afa",
    "name": "System Service Discovery",
    "description": "Adversaries may try to gather information about registered local system services. Adversaries may obtain information about services using tools as well as OS utility commands such as <code>sc query</code>, <code>tasklist /svc</code>, <code>systemctl --type=service</code>, and <code>net start</code>. Adversaries may also gather information about schedule tasks via commands such as `schtasks` on Windows or `crontab -l` on Linux and macOS.(Citation: Elastic Security Labs GOSAR 2024)(Citation: SentinelLabs macOS Malware 2021)(Citation: Splunk Linux Gormir 2024)(Citation: Aquasec Kinsing 2020)\n\nAdversaries may use the information from [System Service Discovery](https://attack.mitre.org/techniques/T1007) during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
    "tactic": "discovery",
    "technique_name": "System Service Discovery",
    "technique_id": "T1007",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1007: System Service Discovery'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1007: System Service Discovery'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1007: System Service Discovery'"
      }
    ],
    "ability_id": "attack-pattern--322bad5a-1c49-4d23-ab79-76d641794afa"
  },
  {
    "id": "attack-pattern--3c4a2599-71ee-4405-ba1e-0e28414b4bc5",
    "name": "Data from Local System",
    "description": "Adversaries may search local system sources, such as file systems, configuration files, local databases, virtual machine files, or process memory, to find files of interest and sensitive data prior to Exfiltration.\n\nAdversaries may do this using a [Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059), such as [cmd](https://attack.mitre.org/software/S0106) as well as a [Network Device CLI](https://attack.mitre.org/techniques/T1059/008), which have functionality to interact with the file system to gather information.(Citation: show_run_config_cmd_cisco) Adversaries may also use [Automated Collection](https://attack.mitre.org/techniques/T1119) on the local system.\n",
    "tactic": "collection",
    "technique_name": "Data from Local System",
    "technique_id": "T1005",
    "executors": [
      {
        "name": "sh",
        "platform": "linux",
        "command": "echo 'Simulated execution of T1005: Data from Local System'"
      },
      {
        "name": "psh",
        "platform": "windows",
        "command": "Write-Host 'Simulated execution of T1005: Data from Local System'"
      },
      {
        "name": "sh",
        "platform": "darwin",
        "command": "echo 'Simulated execution of T1005: Data from Local System'"
      }
    ],
    "ability_id": "attack-pattern--3c4a2599-71ee-4405-ba1e-0e28414b4bc5"
  }
]